archive/before-2018-11-10/2018-07-19-lldp协议笔记.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-07-19-lldp协议笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-07-19-lldp协议笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org033ce9c">1. lldpd协议</a>
<ul>
<li><a href="#orge41716e">1.1. 源码和配置相关</a></li>
<li><a href="#org57372b5">1.2. Wiki: Link Layer Discovery Protocol</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org033ce9c" class="outline-2">
<h2 id="org033ce9c"><span class="section-number-2">1</span> lldpd协议</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge41716e" class="outline-3">
<h3 id="orge41716e"><span class="section-number-3">1.1</span> 源码和配置相关</h3>
<div class="outline-text-3" id="text-1-1">
<p>
lldpd代码中编译会生成server端即lldpd。还有一个client端，名为lldpcli。
</p>

<p>
可以通过lldpcli来配置lldpd。比如下面这些测试命令，具体可以man一下：
</p>
<div class="org-src-container">
<pre class="src src-sh">lldpcli show configuration
lldpcli show statistics
lldpcli show statistics ports eth0
lldpcli show statistics ports wlan0

sudo lldpcli configure system description <span style="color: #ff4ea3;">"my little server"</span>
sudo lldpcli unconfigure system description

sudo lldpcli pause
sudo lldpcli resume

lldpcli show neighbors ports eth0
</pre>
</div>

<p>
lldpd启动的时候有对应的配置文件，默认为 <code>/etc/lldpd.conf</code> 和
<code>/etc/lldpd.d</code> 目录下的所有以 <code>.conf</code> 结尾的文件。这些配置文件其实
就是lldpcli命令的集合。每行就是一行lldpcli命令。比如当前我测试的配
置文件可以这样写：
</p>
<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">You can put lldpd configuration snippets into this directory.</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Upon start, lldpd will read each files in this directory and execute content</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">as if they were passed as arguments to lldpcli</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Files should be suffixed by .conf and have content like:</span>
<span style="color: #6c6c6c; font-style: italic;">#   </span><span style="color: #6c6c6c; font-style: italic;">configure system description 'my little server'</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">See lldpcli(8) for more details.</span>

<span style="color: #ff8700;">configure</span> system description <span style="color: #ff4ea3;">'my little server'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org57372b5" class="outline-3">
<h3 id="org57372b5"><span class="section-number-3">1.2</span> <a href="https://en.wikipedia.org/wiki/Link_Layer_Discovery_Protocol">Wiki: Link Layer Discovery Protocol</a></h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
LLDP information is sent by devices from each of their interfaces at
a fixed interval, in the form of an Ethernet frame. Each frame
contains one LLDP Data Unit (LLDPDU). Each LLDPDU is a sequence of
type-length-value (TLV) structures.

LLDP消息定时从设备的每个网卡中发出。消息都是以太网的frame形式。每个
frame包含了一个LLDP的数据单元。每个LLDP数据单元是多个TLV结构的组合。

The Ethernet frame used in LLDP has its destination MAC address
typically set to a special multicast address that 802.1D-compliant
bridges do not forward.^[note 1] Other multicast and unicast
destination addresses are permitted. The EtherType field is set to
0x88cc.

目的地址一般都是特定的多播地址，以保证802.1D的网桥不会转发这些报文。其
它的多播或都单播地址都是允许的。EtheType这个区域填0x88cc。
</pre>

<p>
TLV的结构如下：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> TLV structure</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">7 bits</td>
<td class="org-left">9 bits</td>
<td class="org-left">0-511 octets</td>
</tr>
</tbody>
</table>

<p>
结构化的TLV可以克服兼容性问题，高级版本中可能加入新type的TLV。低版本
碰到不认识的type后，直接跳过对应长度处理下一个TLV即可。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> LLDP Ethernet frame structure</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Preamble</th>
<th scope="col" class="org-left">Destination MAC</th>
<th scope="col" class="org-left">Source MAC</th>
<th scope="col" class="org-right">Ethertype</th>
<th scope="col" class="org-left">Chassis ID TLV</th>
<th scope="col" class="org-left">Port ID TLV</th>
<th scope="col" class="org-left">Time to live TLV</th>
<th scope="col" class="org-left">Optional TLVs</th>
<th scope="col" class="org-left">End of LLDPDU TLV</th>
<th scope="col" class="org-left">Frame check sequence</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">01:80:c2:00:00: <code>[00 or 0e or 03]</code></td>
<td class="org-left">Station's address</td>
<td class="org-right">0x88CC</td>
<td class="org-left">Type=1</td>
<td class="org-left">Type=2</td>
<td class="org-left">Type=3</td>
<td class="org-left">Zero or more complete TLVs</td>
<td class="org-left">Type=0, Length=0</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>